{
  "tutorial": {
    "name": "Tutorial",
    "dialogs": ["움직이려면 방향키를 누르거나 화면을 터치해보세요.", "잘하셨습니다. 캐릭터와 상호작용하려면 캐릭터 앞에 가서 엔터키를 누르거나 화면을 터치해보세요.", "게임 조작법을 모두 설명했습니다. 이제 모험을 떠나보세요." ]},
  "system": {
    "name": "System",
    "dialogs": ["꽃을 찾았다.", "앗!! 뭔가 숨겨진게 나왔다." ]},
  "main": {
    "name": "수현",
    "dialogs": ["어떡해 ㅠㅠ.. 남자친구가 고양이가 되어버렸어.",
      "이 마을에는 훌륭한 마법 선생님이 있으니 여기서 반드시 방법을 찾아봐야겠어.",
      "선생님 제 남자친구가 고양이가 되어버렸어요. 혹시 고양이를 사람으로 되돌리는 마법을 배울 수 있을까요?",
      "제가 필요한 재료들을 모두 찾아온다면 좀 도와주실 수 있으신가요?",
      "안녕하세요? 혹시 기억 속 모습을 되돌려주는 마법이 적힌 마법책이 있나요?",
      "어떡하죠? 남자친구가 고양이로 변해버려서 남자친구를 옛 모습으로 돌려주려면 꼭 그 책이 필요해요.",
      "그럼 그 책이라도 주세요. 맥고나걸 교수님은 실력이 좋으시니까 뭔가 방법이 있을거에요.",
      "똑같은 책은 아니지만 기억 속 모습을 환상으로 형상화시키는 마법이 적힌 책을 구했어요.",
      "그건 어디서 구할 수 있나요?",
      "그럼 다녀오겠습니다.",
      "안녕하세요? 마법의 효과를 키워주는 재료가 있다고 해서 왔어요.",
      "그렇다면 좀 캐가도 괜찮을까요?",
      "감사합니다!",
      "네 이 꽃이 맞나요?",
      "성장 물약을 좀 구하러 왔어요.",
      "앗 그정도로는 부족한데요... 사람 크기까지 키워주는 물약은 없나요?",
      "알겠습니다 ㅠㅠ 일단 그정도로 만족해야겠네요.",
      "혹시 방법이 없을까요? 방금 가져온 마력 강화 재료를 이용하면..",
      "우리가 처음 사귄 날 정도면 강한 기억일까요?",
      "그 날은 2022년 추석 전날 9월 9일이에요!",
      "너무 너무 다행이다! 다시 사람이 되어서 너무 기뻐. 고양이어도 귀엽지만 역시 사람일때가 더 좋아.",
      "고백? 무슨 고백?",
      "오! 우리 같이 찾으러 가보자~~"]},
  "npc1": {
    "name": "중고마법서점",
    "dialogs": ["마법 서적 팝니다. 옛날 책에는 잊혀진 마법이 있을지도 몰라요.",
      "기억 속 모습을 되돌려주는 마법이 적힌 마법책이요? 제가 가진건 기억 속 모습을 생생히 보여주는 마법책 뿐인데요..",
      "기억 속 모습을 환상으로 형상화 시켜주는 마법을 더 강하게 시전한다면 비슷한 효과를 낼 수 있을거 같은데요!",
      "네. 꼭 성공하시길 바랄께요!"]},
  "npc2": {
    "name": "남자친구",
    "dialogs": ["야.옹.", "야옹 야옹!",
      "앗 내 모습이 다시 사람이 되었어! 수현아 너무 고마워! 우리의 기억들이 나를 다시 사람으로 만들어줬어.",
      "나를 포기하지 않고 구해준 수현 너무 고마워. 넌 나의 평생의 은인이야. 만약 사람으로 다시 돌아온다면 내 사랑 수현에게 고백하려고 했어.",
      "그걸 위해 내가 준비한게 있어. 고양이 시절일 때 이 마을에 수현에게 줄 선물을 숨겨놨어.",
      "응! 고양이 시절이라 잘 기억 안나지만 꽃 향기가 가득한 곳이었어."]},
  "npc3": {
    "name": "마법 재료 상인",
    "dialogs": ["반짝이 꽃부터 독초까지 온갖 마법 재료가 모두 있습니다.",
      "마력을 키워주는 재료는 다 팔려서 지금 없어요. 하지만 우리 건물 옆에 꽃밭에 가면 구할 수 있지요.",
      "물론이죠. 그 꽃은 추운곳에서 자라서 얼음위에 피어있어요."]},
  "npc4": {
    "name": "맥고나걸 마법 교수",
    "dialogs": ["안녕하세요? 날씨가 참 좋죠?",
      "고양이를 사람으로 되돌리는 마법이라... 기억속 모습을 되돌려주는 마법이 적혀있는 마법책이랑 작은 고양이를 다시 사람의 크기로 키워줄 마법 물약이 필요해요.",
      "물론입니다. 일단 서점에 먼저 다녀오세요.",
      "책을 구해 오셨나요?",
      "그것 만으로는 어려운데.. 그렇다면 마법을 더 강하게 할 수있는 마력 재료가 필요하겠네요.",
      "그건 마법 재료 상점에 있을거에요.",
      "재료는 구하셨나요?",
      "네. 이제 물약만 구하시면 되겠네요.",
      "구해오신 물약은 너무 약하네요. 이정도면 어린이 사이즈로 키울 수 밖에 없겠는데요..",
      "안타깝게도 마력 강화 재료는 마법당 한번밖에 사용하지 못해요. 하지만 만약 강력한 기억을 주입한다면 마법이 강해질테니 혹시 서로에게 가장 중요한 기억이 있나요?",
      "좋은 생각이네요. 한번 시도해볼께요. 그럼 그 날이 언제이죠?",
      "그럼 기억책에 22년 9월 9일을 넣고... 마력 강화 재료를 포션에 넣어서 마법을 발동하면..."]},
  "npc5": {
    "name": "신비로운 마법 물약 제작소",
    "dialogs": ["어서오세요. 사랑의 포션을 찾으시나요?",
      "이 성장물약은 작은 고양이를 골든 리트리버 정도의 크기까지 키워줄 수 있답니다.",
      "그정도로 크게 키워주려면 포션을 새로 만들어야 하는데 시간이 오래 걸려서 지금은 없답니다."]
  }
}

